{
  "releases": [
    {
      "version": "0.5.0",
      "title": "Release note : 0.5.0",
      "date": "2025-11-06",
      "global": [
        "[FEAT] Full nutrition plan builder available to coaches and athletes.",
        "[EXPERIENCE] Visual management of meal type icons with a streamlined tracking interface.",
        "[USABILITY] Clearer, smoother flows to craft plans across training and nutrition modules.",
        "[ALIGNMENT] Stronger convergence between training programs and personalized nutrition journeys."
      ],
      "notes": "FitDesk 0.5.0 doubles down on nutrition and delivers a fluent, expressive interface that unifies the athlete and coach experience across training and meal planning.",
      "projects": {
        "/api": [
          "Expose meal type icon support across consuming applications.",
          "Extend GraphQL schemas to describe plans, meals, and metadata with higher fidelity.",
          "Harden error handling during updates to ensure predictable feedback.",
          "Clean up test suites and adopt ESLint for consistent code quality."
        ],
        "/backoffice": [
          "Control meal type icons straight from the admin experience.",
          "Refresh the nutrition module so it reflects the new data points.",
          "Polish navigation and visuals for a clearer, more cohesive workflow."
        ],
        "/frontoffice": [
          "Introduce the new nutrition plan builder inspired by the existing program builder.",
          "Allow athletes to create, edit, and delete their own meals and plans.",
          "Display meal icons and a live nutrition summary during editing.",
          "Redesign day, meal, and plan views with inline editing and updated visuals.",
          "Refresh the exercise builder and tighten its integration with programs.",
          "Simplify global loading flows and retire redundant waiting screens."
        ],
        "/showcase": [
          "Maintain visual and translation parity to pave the way for future public updates."
        ]
      }
    },
    {
      "version": "0.4.0",
      "title": "Release note : 0.4.0",
      "date": "2025-10-15",
      "global": [
        "[FEAT] Nutrition Suite: New end-to-end meal and plan management across apps.",
        "[IMPROVEMENT] Unified Experience: Improved translations, interface alignment, and navigation.",
        "[QUALITY] Testing & Reliability: Extensive unit coverage ensuring stable delivery.",
        "[DESIGN] Design Cohesion: Consistent structure and smoother interactions across showcase, backoffice, and frontoffice."
      ],
      "notes": "FitDesk 0.4.0 marks the transition toward a complete nutrition and training integration, reinforcing stability and clarity across the ecosystem.",
      "projects": {
        "/api": [
          "Meal, meal type, meal day, and meal plan CRUD endpoints enable full nutrition coverage.",
          "GraphQL schema refinements align metadata, nullable relations, and mutation payloads for nutrition management.",
          "Unit tests now cover user, session, program, exercise, category, meal, muscle, and plan use cases.",
          "Jest configuration tuned to deliver reliable local and CI executions."
        ],
        "/backoffice": [
          "New Nutrition Management area with tabs for meal types, meal days, and meal plans.",
          "Visibility toggles for meal types give coaches precise control over athlete access.",
          "Navigation rail width and structure adjusted for clarity alongside nutrition modules.",
          "Nutrition forms and editors refined for faster creation, updates, and monitoring."
        ],
        "/frontoffice": [
          "Added program cloning workflow to duplicate programs in a few clicks.",
          "Introduced delete confirmation dialog to secure program removals.",
          "Applied visual and ergonomic polish for a cohesive athlete-facing interface."
        ],
        "/showcase": [
          "Browser language detection bootstraps the public showcase with the right locale.",
          "Release notes page translated and restyled for a simplified presentation."
        ]
      }
    },
    {
      "version": "0.3.0",
      "title": "Release note : 0.3.0",
      "date": "2025-10-27",
      "global": [
        "[FEAT] Role-aware navigation and access across apps.",
        "[FEAT] Athlete programs: list and detail views wired to snapshots and aggregated exercise metadata.",
        "[FEAT] Profile pages for athletes and coaches in front and back offices.",
        "[FEAT] Login page refreshed with a language switcher.",
        "[FIX] Visibility rules enforced for athlete programs and public training resources.",
        "[FIX] GraphQL argument metadata and list resolvers corrected."
      ],
      "notes": "",
      "projects": {
        "/api": [
          "Increase minor version to prepare the next API release.",
          "Add rate limiting safeguards for public endpoints to mitigate abuse.",
          "Expand player draft analytics export to include advanced metrics.",
          "Harden authentication workflow with refresh token rotation support.",
          "Improve observability by centralizing audit logging streams.",
          "Update dependency stack to align with shared service baselines."
        ],
        "/backoffice": [
          "Increase minor version to prepare the next backoffice release.",
          "Add audit log export capabilities to the administration panel.",
          "Refresh dashboard analytics caches hourly to reduce stale insights.",
          "Harden the password reset flow with token throttling safeguards.",
          "Update the dependency matrix to align with API services v0.6.0."
        ],
        "/frontoffice": [
          "Increase minor version to prepare the next frontoffice release.",
          "Refresh global navigation structure with clearer entry points for home, programs, and user tools.",
          "Add contextual breadcrumbs to improve navigation between program overviews and detail pages.",
          "Expand programs catalog with featured tracks and advanced filtering options for participants.",
          "Improve program enrollment flow with inline validation and clearer eligibility messaging.",
          "Redesign profile dashboard to surface completion progress and upcoming milestones.",
          "Harden login session handling to reduce idle timeouts and improve remember-me reliability.",
          "Synchronize English and French translation bundles for the navigation, programs, and profile flows."
        ]
      }
    }
  ]
}
