{
  "releases": [
    {
      "version": "0.13.0",
      "title": "FitDesk Platform — Dashboard & Visualization",
      "date": "2026-01-21",
      "global": [
        "Redesigned decision-oriented dashboard with reorganized widgets and essential indicators.",
        "Advanced data visualization with pie charts and distribution diagrams.",
        "Enhanced session and program tracking with notes, feedback, and evaluations.",
        "More visible and better integrated nutrition in the ecosystem.",
        "Strengthened navigation and multilingual experience."
      ],
      "notes": "Version 0.13.0 marks a significant visual and functional turning point for FitDesk. After strengthening real activity tracking in 0.12.0, this version focuses on readability, quick comprehension, and highlighting key data. FitDesk evolves into a true management dashboard for coaches and teams. Information is no longer just accessible: it is staged, prioritized, and immediately understandable.",
      "projects": {
        "/api": [
          "Support for new indicators and visibility states.",
          "Alignment with new screens and graphics.",
          "Stabilization of exchanges for program and nutrition builders.",
          "API serving reading and understanding, not just raw data."
        ],
        "/backoffice": [
          "Visual and functional alignment with frontoffice.",
          "Shared components for better consistency.",
          "Preparation for advanced analysis and supervision use cases.",
          "More readable and reliable backoffice for administration."
        ],
        "/frontoffice": [
          "Major redesign of coach dashboard with new visual and interactive widgets.",
          "Improved program and session tracking screens.",
          "Seamless nutrition integration in main views.",
          "Frontoffice becomes a daily management tool, not just execution."
        ],
        "/showcase": [
          "Complete showcase project initialization.",
          "Solid foundation for a modern, multilingual, and consistent showcase.",
          "Preparation for more value and results-oriented communication."
        ]
      }
    },
    {
      "version": "0.12.0",
      "title": "Calendar View & Effort Analysis",
      "date": "2026-01-12",
      "global": [
        "Introduction of a central calendar to visualize actual activity (sessions and meals).",
        "Rate of Perceived Exertion (RPE): athletes can rate the difficulty of their sessions.",
        "Secure access for coaches to execution details (Program Records).",
        "Improved data reliability: hard delete and readable slugs."
      ],
      "notes": "Version 0.12.0 marks a significant maturity step for FitDesk focused on real athlete activity tracking. It transforms the platform from a planning tool to an operational monitoring tool, featuring a central calendar and qualitative effort analysis (RPE).",
      "projects": {
        "/api": [
          "Strengthened access rules: only the athlete and their coach can view sensitive data.",
          "Introduction of Hard Delete to clean up obsolete data.",
          "Improved slug generation for better consistency.",
          "Enhanced security for activity record access."
        ],
        "/backoffice": [
          "New Calendar tab per Athlete for 360° supervision.",
          "Detailed session analysis (Program Records) with actual loads and feedback.",
          "Visualization of difficulty ratings (RPE) and comments.",
          "Redesigned interfaces to display Satisfaction, Difficulty, and Duration."
        ],
        "/frontoffice": [
          "Personal Calendar view with visual badges for each activity.",
          "RPE input (Easy, Moderate, Extreme) upon session validation.",
          "Clickable session cards detailing actual execution.",
          "Fluid navigation between days and months with overflow management."
        ],
        "/showcase": [
          "Updated release notes for 0.12.0 featuring new calendar and RPE capabilities."
        ]
      }
    },
    {
      "version": "0.11.0",
      "title": "Execution Tracking & Athlete Performance",
      "date": "2026-01-04",
      "global": [
        "New execution tracking module (Records) for training sessions and meals.",
        "Advanced prospect management with detailed editing and activity history.",
        "Major UI improvements (Responsiveness, Tooltips, Fixed Layouts).",
        "Infrastructure maintenance automation (SSL, Nginx, Docker)."
      ],
      "notes": "Version 0.11.0 takes a major step forward by enabling real-time tracking of program execution and nutrition. Athletes can now log their sessions (weight, reps, feedback) and meals, while coaches gain more powerful tools for prospect management.",
      "projects": {
        "/api": [
          "New 'Program Records' and 'Meal Records' system with state management (CREATE, DRAFT, FINISH).",
          "Automatic slug generation and removal of redundant parameters in GraphQL APIs.",
          "Extended prospect model with new metadata fields and preferences.",
          "Full technical documentation for new tracking use cases."
        ],
        "/backoffice": [
          "New prospect management module with full editor and advanced filters.",
          "Introduction of Autocomplete components for smooth entity selection.",
          "Simplified record administration interface for coaches."
        ],
        "/frontoffice": [
          "Live tracking experience for training sessions (load, reps, duration).",
          "Nutrition tracking interface allowing plan meal validation.",
          "Responsive header and layout redesign for optimal tablet usage.",
          "Systematic integration of tooltips and visual cues to enhance UX."
        ],
        "/showcase": [
          "Version 0.11.0 release notes update."
        ]
      }
    },
    {
      "version": "0.10.0",
      "title": "User Autonomy & Self-Service",
      "date": "2025-12-21",
      "global": [
        "Complete user autonomy: self-service profile and password updates.",
        "New modern 'Glass' design for improved readability.",
        "Dedicated 'My Information' space for athletes to manage health, goals, and preferences.",
        "Enhanced nutrition builder with daily summaries and global averages."
      ],
      "notes": "Version 0.10.0 marks a turning point towards greater autonomy for your users. We are introducing major 'Self-Service' features allowing athletes and coaches to manage their personal information and security themselves. In parallel, the visual experience has been modernized with a new streamlined interface.",
      "projects": {
        "/api": [
          "Support for user profile and password updates (self-service).",
          "New user deletion features (soft/hard delete).",
          "Core dependency updates (Mongoose, etc.) and cleanup of obsolete fields."
        ],
        "/backoffice": [
          "Administration tools for password reset and account deletion.",
          "New design for login cards and widgets with Glassmorphism effect."
        ],
        "/frontoffice": [
          "Editable profile pages for all users.",
          "New navigation with collapsible sub-menus (e.g., Athletes section).",
          "Intelligent nutrition builder with real-time daily calculations.",
          "Explicit action buttons replacing standalone icons."
        ],
        "/showcase": [
          "Release note update."
        ]
      }
    },
    {
      "version": "0.9.0",
      "title": "Prospect Conversion & Athlete Monitoring",
      "date": "2025-12-14",
      "global": [
        "Direct conversion from prospects to athletes with automatic account creation and coach linking.",
        "New Athlete Profile centralizing programs, nutrition, objectives, and health data.",
        "Unified Visibility management (Private/Public) for programs, sessions, and nutrition plans.",
        "Increased flexibility in session creation (duplicates, ordering) and optimized navigation."
      ],
      "notes": "FitDesk 0.9.0 completes the CRM cycle by bridging sales to operational tracking. This version introduces automatic prospect-to-athlete conversion and deploys a '360° view' athlete profile integrating nutrition, sports, and personal data, all supported by a clearer and standardized interface.",
      "projects": {
        "/api": [
          "Transactional support for prospect-to-athlete conversion.",
          "Standardization of prospect statuses and reinforced multilingual slug generation.",
          "New entries for health data (allergies, conditions) and athlete metadata."
        ],
        "/backoffice": [
          "Stabilized user administration panel with display fixes.",
          "Clarification of editable fields and securing of sensitive data."
        ],
        "/frontoffice": [
          "Quick Prospect → Athlete conversion button from the pipeline.",
          "Dedicated Nutrition and Programs tabs integrated directly into the Athlete profile.",
          "UX improvements: result counters, smart truncated titles, and mobile responsiveness."
        ],
        "/showcase": [
          "Content updates to reflect the 'Athlete Monitoring' approach and the completion of the CRM cycle."
        ]
      }
    },
    {
      "version": "0.8.0",
      "title": "Stronger Pipeline & Split Dashboards",
      "date": "2025-12-05",
      "global": [
        "Full separation of coach and athlete dashboards for clearer reading.",
        "Prospect pipeline upgraded with KPIs, unified filters, history, and per-column metrics.",
        "Hardened navigation with stronger protections against unauthorized access.",
        "Cleanup of legacy slugs on programs, plans, and clients for cleaner data."
      ],
      "notes": "FitDesk 0.8.0 doubles down on commercial steering: a richer pipeline, reliable metrics, and a clear split between coaches and athletes. Prospect tracking becomes a strategic tool, powered by a cleaner API and an elevated front.",
      "projects": {
        "/api": [
          "Automatically exclude soft-deleted prospects from results.",
          "Remove slugs from mutations across programs, nutrition plans, and clients.",
          "Provide full pipeline step history, now exposed for the frontend.",
          "Allow every role to browse exercises, simplifying imports and reuse."
        ],
        "/backoffice": [
          "Coach and athlete dashboards are now split and better structured.",
          "Controlled access to sensitive sections to avoid navigation mistakes.",
          "Prospects module upgrades: unified filters, clearer cards, and consolidated indicators."
        ],
        "/frontoffice": [
          "New KPI summary at the top of the pipeline (volume, sources, progression).",
          "Transition history and time-in-stage visible directly on cards.",
          "Prospect cards redesigned with highlighted filters for better readability.",
          "Removed slugs from create/edit flows and aligned labels across the UI."
        ],
        "/showcase": [
          "Editorial alignment to support upcoming commercial enhancements."
        ]
      }
    },
    {
      "version": "0.7.0",
      "title": "Prospect Management & CRM Pipeline",
      "date": "2025-11-24",
      "global": [
        "Complete overhaul of the Prospects module, with stage management and drag-and-drop.",
        "Standardization of statuses and terminology across API, backoffice, and frontoffice.",
        "Optimization of navigation and multilingual interfaces.",
        "Improved design and readability on all views."
      ],
      "notes": "FitDesk 0.7.0 evolves the platform into a true CRM solution for coaches. The relationship between the coach and their prospects becomes visual, fluid, and manageable from a single space. This version unifies vocabulary, simplifies processes, and prepares for the next steps: converting prospects into active clients within a fully integrated journey.",
      "projects": {
        "/api": [
          "Overhaul of internal prospect logic, with standardization of statuses and shared values.",
          "Schema update to support pipeline states and transition management.",
          "Use case documentation for better functional consistency.",
          "Cleanup of old client concepts in favor of the unified prospect model."
        ],
        "/backoffice": [
          "New Prospects module with visual stage pipeline (drag & drop).",
          "Prospect tracking based on commercial status and last update.",
          "Overhaul of prospect cards with more synthetic information.",
          "Automatic adaptation to the coach's language for fluid multilingual management."
        ],
        "/frontoffice": [
          "Replacement of the 'Clients' module with a redesigned Prospects module.",
          "Integrated pipeline view with cards, statuses, and drag-and-drop interactions.",
          "Automatic filtering according to the working language.",
          "Better consistency of terms and design between sections (programs, nutrition, management)."
        ],
        "/showcase": [
          "No functional changes, but content harmonization to match the new terminology (prospect instead of client) and preparation for future business-oriented evolutions."
        ]
      }
    },
    {
      "version": "0.6.0",
      "title": "Coach-Athlete Relationship & Unified Tracking",
      "date": "2025-11-20",
      "global": [
        "[FEAT] End-to-end management for prospects, clients, and athletes with a unified tracking flow.",
        "[RELATIONSHIP] Direct coach ↔ athlete relationship modeling to structure personalized guidance.",
        "[VISIBILITY] Refined visibility controls for programs, meals, and other flagship assets.",
        "[EXPERIENCE] Harmonized interfaces across modules so coaches navigate their daily flows faster."
      ],
      "notes": "FitDesk 0.6.0 elevates the human relationship layer: teams can qualify prospects, manage clients, and follow athletes while keeping clear visibility on programs, plans, and shared content.",
      "projects": {
        "/api": [
          "Add the coach–athlete relationship system with flexible handling and soft deletion.",
          "Introduce the objectives and preferences foundation for clients across nutrition, activity, and sport goals.",
          "Deliver full prospect management with statuses, levels, sources, and activity preferences.",
          "Standardize visibility statuses for programs and meal plans.",
          "Simplify models and retire the legacy difficulty levels to clarify the business layer."
        ],
        "/backoffice": [
          "New prospect and client management module with end-to-end tracking of status, objectives, and preferences.",
          "Dedicated Athletes section that orchestrates coach–athlete relationships.",
          "Control visibility for programs and nutrition plans directly inside the backoffice.",
          "Revamped data presentation: richer client records, sources, creators, and details surfaced at a glance."
        ],
        "/frontoffice": [
          "Full client management module covering creation, edition, deletion, and contextual tracking.",
          "Athletes area connected with the backoffice to manage relationships and field follow-up.",
          "Forms and thematic blocks redesigned to stay in line with the main design language.",
          "Legacy data trimmed, including the removal of the former exercise difficulty concept."
        ],
        "/showcase": [
          "Internal adjustments to stay aligned with the refreshed business modules."
        ]
      }
    },
    {
      "version": "0.5.0",
      "title": "Nutrition Plan Builder",
      "date": "2025-11-06",
      "global": [
        "[FEAT] Full nutrition plan builder available to coaches and athletes.",
        "[EXPERIENCE] Visual management of meal type icons with a streamlined tracking interface.",
        "[USABILITY] Clearer, smoother flows to craft plans across training and nutrition modules.",
        "[ALIGNMENT] Stronger convergence between training programs and personalized nutrition journeys."
      ],
      "notes": "FitDesk 0.5.0 doubles down on nutrition and delivers a fluent, expressive interface that unifies the athlete and coach experience across training and meal planning.",
      "projects": {
        "/api": [
          "Expose meal type icon support across consuming applications.",
          "Extend GraphQL schemas to describe plans, meals, and metadata with higher fidelity.",
          "Harden error handling during updates to ensure predictable feedback.",
          "Clean up test suites and adopt ESLint for consistent code quality."
        ],
        "/backoffice": [
          "Control meal type icons straight from the admin experience.",
          "Refresh the nutrition module so it reflects the new data points.",
          "Polish navigation and visuals for a clearer, more cohesive workflow."
        ],
        "/frontoffice": [
          "Introduce the new nutrition plan builder inspired by the existing program builder.",
          "Allow athletes to create, edit, and delete their own meals and plans.",
          "Display meal icons and a live nutrition summary during editing.",
          "Redesign day, meal, and plan views with inline editing and updated visuals.",
          "Refresh the exercise builder and tighten its integration with programs.",
          "Simplify global loading flows and retire redundant waiting screens."
        ],
        "/showcase": [
          "Maintain visual and translation parity to pave the way for future public updates."
        ]
      }
    },
    {
      "version": "0.4.0",
      "title": "Complete Nutrition Suite",
      "date": "2025-10-15",
      "global": [
        "[FEAT] Nutrition Suite: New end-to-end meal and plan management across apps.",
        "[IMPROVEMENT] Unified Experience: Improved translations, interface alignment, and navigation.",
        "[QUALITY] Testing & Reliability: Extensive unit coverage ensuring stable delivery.",
        "[DESIGN] Design Cohesion: Consistent structure and smoother interactions across showcase, backoffice, and frontoffice."
      ],
      "notes": "FitDesk 0.4.0 marks the transition toward a complete nutrition and training integration, reinforcing stability and clarity across the ecosystem.",
      "projects": {
        "/api": [
          "Meal, meal type, meal day, and meal plan CRUD endpoints enable full nutrition coverage.",
          "GraphQL schema refinements align metadata, nullable relations, and mutation payloads for nutrition management.",
          "Unit tests now cover user, session, program, exercise, category, meal, muscle, and plan use cases.",
          "Jest configuration tuned to deliver reliable local and CI executions."
        ],
        "/backoffice": [
          "New Nutrition Management area with tabs for meal types, meal days, and meal plans.",
          "Visibility toggles for meal types give coaches precise control over athlete access.",
          "Navigation rail width and structure adjusted for clarity alongside nutrition modules.",
          "Nutrition forms and editors refined for faster creation, updates, and monitoring."
        ],
        "/frontoffice": [
          "Added program cloning workflow to duplicate programs in a few clicks.",
          "Introduced delete confirmation dialog to secure program removals.",
          "Applied visual and ergonomic polish for a cohesive athlete-facing interface."
        ],
        "/showcase": [
          "Browser language detection bootstraps the public showcase with the right locale.",
          "Release notes page translated and restyled for a simplified presentation."
        ]
      }
    },
    {
      "version": "0.3.0",
      "title": "Role-Based Navigation & Profiles",
      "date": "2025-10-27",
      "global": [
        "[FEAT] Role-aware navigation and access across apps.",
        "[FEAT] Athlete programs: list and detail views wired to snapshots and aggregated exercise metadata.",
        "[FEAT] Profile pages for athletes and coaches in front and back offices.",
        "[FEAT] Login page refreshed with a language switcher.",
        "[FIX] Visibility rules enforced for athlete programs and public training resources.",
        "[FIX] GraphQL argument metadata and list resolvers corrected."
      ],
      "notes": "",
      "projects": {
        "/api": [
          "Increase minor version to prepare the next API release.",
          "Add rate limiting safeguards for public endpoints to mitigate abuse.",
          "Expand player draft analytics export to include advanced metrics.",
          "Harden authentication workflow with refresh token rotation support.",
          "Improve observability by centralizing audit logging streams.",
          "Update dependency stack to align with shared service baselines."
        ],
        "/backoffice": [
          "Increase minor version to prepare the next backoffice release.",
          "Add audit log export capabilities to the administration panel.",
          "Refresh dashboard analytics caches hourly to reduce stale insights.",
          "Harden the password reset flow with token throttling safeguards.",
          "Update the dependency matrix to align with API services v0.6.0."
        ],
        "/frontoffice": [
          "Increase minor version to prepare the next frontoffice release.",
          "Refresh global navigation structure with clearer entry points for home, programs, and user tools.",
          "Add contextual breadcrumbs to improve navigation between program overviews and detail pages.",
          "Expand programs catalog with featured tracks and advanced filtering options for participants.",
          "Improve program enrollment flow with inline validation and clearer eligibility messaging.",
          "Redesign profile dashboard to surface completion progress and upcoming milestones.",
          "Harden login session handling to reduce idle timeouts and improve remember-me reliability.",
          "Synchronize English and French translation bundles for the navigation, programs, and profile flows."
        ]
      }
    }
  ]
}