{
  "releases": [
    {
      "version": "0.3.0",
      "title": "Note de mise à jour : 0.3.0",
      "date": "2025-10-27",
      "global": [
        "[NOUVEAUTÉ] Navigation et accès désormais adaptés à chaque rôle sur l'ensemble des applications.",
        "[NOUVEAUTÉ] Programmes athlètes enrichis avec listes, fiches détaillées et indicateurs issus des instantanés.",
        "[NOUVEAUTÉ] Profils athlètes et coachs harmonisés entre les interfaces front et back office.",
        "[NOUVEAUTÉ] Page de connexion réinventée avec un sélecteur de langue accessible dès l'accueil.",
        "[CORRECTION] Règles de visibilité consolidées pour les programmes athlètes et les ressources d'entraînement publiques.",
        "[CORRECTION] Métadonnées des arguments GraphQL et résolutions de listes ajustées pour garantir des retours cohérents."
      ],
      "notes": "",
      "projects": {
        "/api": [
          "Montée de version mineure en préparation du prochain jalon API.",
          "Ajout de garde-fous de limitation de débit sur les points d'accès publics afin de prévenir les abus.",
          "Extension de l'export analytique du repêchage pour intégrer des métriques avancées.",
          "Renforcement de l'authentification avec rotation des jetons de rafraîchissement.",
          "Centralisation des flux de journalisation d'audit pour une observabilité uniforme.",
          "Mise à niveau des dépendances pour rester aligné avec la base de services partagée."
        ],
        "/backoffice": [
          "Montée de version mineure en vue du prochain déploiement backoffice.",
          "Ajout de l'export du journal d'audit directement depuis le panneau d'administration.",
          "Actualisation horaire des caches analytiques du tableau de bord pour limiter les données obsolètes.",
          "Durcissement du parcours de réinitialisation de mot de passe grâce à un contrôle de la fréquence des jetons.",
          "Mise à jour de la matrice de dépendances pour s'aligner sur les services API en v0.6.0."
        ],
        "/frontoffice": [
          "Montée de version mineure en préparation du prochain cycle frontoffice.",
          "Réorganisation de la navigation globale avec des points d'entrée clarifiés pour l'accueil, les programmes et les outils utilisateurs.",
          "Ajout de fils d'Ariane contextuels pour fluidifier la circulation entre vues d'ensemble et fiches programme.",
          "Catalogue de programmes enrichi avec des parcours mis en avant et des filtres avancés pour les participants.",
          "Parcours d'inscription aux programmes retravaillé avec validations instantanées et messages d'éligibilité explicites.",
          "Tableau de bord de profil repensé pour mettre en avant la progression et les jalons à venir.",
          "Gestion de session renforcée pour réduire les expirations intempestives et fiabiliser le mode souvenir.",
          "Synchronisation des traductions françaises et anglaises pour les parcours de navigation, programmes et profils."
        ]
      }
    }
  ]
}
