{
  "releases": [
    {
      "version": "0.11.0",
      "title": "Suivi d'Exécution & Performance Athlète",
      "date": "2026-01-04",
      "global": [
        "Nouveau module de suivi d'exécution (Records) pour les séances d'entraînement et les repas.",
        "Gestion avancée des prospects avec édition détaillée et historique d'activité.",
        "Améliorations majeures de l'interface (Responsive, Tooltips, Layouts fixes).",
        "Automatisation de la maintenance infrastructure (SSL, Nginx, Docker)."
      ],
      "notes": "La version 0.11.0 franchit une étape cruciale en permettant le suivi en temps réel de l'exécution des programmes et de la nutrition. Les athlètes peuvent désormais loguer leurs séances (poids, répétitions, ressenti) et leurs repas, tandis que les coachs disposent d'outils plus fins pour la gestion de leurs prospects.",
      "projects": {
        "/api": [
          "Nouveau système de 'Program Records' et 'Meal Records' avec gestion d'états (CREATE, DRAFT, FINISH).",
          "Calcul automatique des slugs et retrait des paramètres redondants dans les APIs GraphQL.",
          "Extension du modèle prospect avec de nouveaux champs de métadonnées et préférences.",
          "Documentation technique complète des nouveaux use-cases de suivi."
        ],
        "/backoffice": [
          "Nouveau module de gestion des prospects avec éditeur complet et filtres avancés.",
          "Introduction des composants Autocomplete pour une sélection fluide des entités.",
          "Interface d'administration des records simplifiée pour les coachs."
        ],
        "/frontoffice": [
          "Expérience de suivi 'Live' pour les sessions d'entraînement (charge, répétitions, durée).",
          "Interface de suivi nutritionnel permettant de valider les repas du plan.",
          "Refonte responsive du header et des layouts pour une utilisation optimale sur tablette.",
          "Intégration systématique de tooltips et d'indices visuels pour améliorer l'UX."
        ],
        "/showcase": [
          "Mise à jour des notes de version 0.11.0."
        ]
      }
    },
    {
      "version": "0.10.0",
      "title": "Autonomie Utilisateur & Self-Service",
      "date": "2025-12-21",
      "global": [
        "Autonomie complète pour les utilisateurs : mise à jour du profil et du mot de passe en self-service.",
        "Nouveau design 'Glass' moderne et épuré pour une meilleure lisibilité.",
        "Espace 'Mes Informations' dédié aux athlètes pour gérer santé, objectifs et préférences.",
        "Constructeur nutritionnel enrichi avec résumés par jour et moyennes globales."
      ],
      "notes": "La version 0.10.0 marque un tournant vers plus d'autonomie pour vos utilisateurs. Nous introduisons des fonctionnalités majeures de 'Self-Service' permettant aux athlètes et aux coachs de gérer eux-mêmes leurs informations personnelles et leur sécurité. En parallèle, l'expérience visuelle a été modernisée avec une nouvelle interface épurée.",
      "projects": {
        "/api": [
          "Support des mises à jour de profil et de mot de passe utilisateur (self-service).",
          "Nouvelles fonctionnalités de suppression (soft/hard delete) des utilisateurs.",
          "Mise à jour des dépendances cœurs (Mongoose, etc.) et nettoyage des champs obsolètes."
        ],
        "/backoffice": [
          "Outils d'administration pour la réinitialisation de mot de passe et suppression de compte.",
          "Nouveau design des cartes de login et widgets avec effet Glassmorphism."
        ],
        "/frontoffice": [
          "Pages de profil éditables pour tous les utilisateurs.",
          "Nouvelle navigation avec sous-menus dépliables (ex: section Athlètes).",
          "Constructeur nutritionnel intelligent avec calculs en temps réel par jour.",
          "Boutons d'action explicites remplaçant les icônes seules."
        ],
        "/showcase": [
          "Mise à jour de la note de version."
        ]
      }
    },
    {
      "version": "0.9.0",
      "title": "Conversion Prospect & Suivi Athlète",
      "date": "2025-12-14",
      "global": [
        "Conversion directe des prospects en athlètes avec création de compte et lien coach automatique.",
        "Nouvelle fiche Athlète centralisant programmes, nutrition, objectifs et données santé.",
        "Gestion de la visibilité (Privé/Public) unifiée pour les programmes, séances et nutrition.",
        "Flexibilité accrue dans la création de séances (doublons, ordonnancement) et navigation optimisée."
      ],
      "notes": "FitDesk 0.9.0 complète le cycle CRM en connectant la vente au suivi opérationnel. Cette version introduit la conversion automatique des prospects en athlètes et déploie une fiche athlète 'vue 360°' intégrant nutrition, sport et données personnelles, le tout supporté par une interface plus lisible et standardisée.",
      "projects": {
        "/api": [
          "Support transactionnel de la conversion prospect vers athlète.",
          "Normalisation des statuts prospects et génération de slugs multilingues renforcée.",
          "Nouvelles entrées pour les données santé (allergies, conditions) et métadonnées athlète."
        ],
        "/backoffice": [
          "Panneau d'administration des utilisateurs stabilisé avec correctifs d'affichage.",
          "Clarification des champs éditables et sécurisation des données sensibles."
        ],
        "/frontoffice": [
          "Bouton de conversion rapide Prospect → Athlète depuis le pipeline.",
          "Onglets dédiés Nutrition et Programmes intégrés directement dans la fiche Athlète.",
          "Amélioration UX : compteurs de résultats, titres tronqués intelligents et responsive mobile."
        ],
        "/showcase": [
          "Mise à jour des contenus pour refléter l'approche 'Suivi Athlète' et la fin du cycle CRM."
        ]
      }
    },
    {
      "version": "0.8.0",
      "title": "Pipeline Commercial Renforcé & Dashboards Séparés",
      "date": "2025-12-05",
      "global": [
        "Séparation complète des dashboards coach et athlète pour une lecture plus claire.",
        "Pipeline prospects enrichi avec KPIs, filtres unifiés, historique et métriques par colonne.",
        "Navigation renforcée avec protections accrues contre les accès non autorisés.",
        "Nettoyage des slugs obsolètes sur les programmes, plans et clients pour des données plus propres."
      ],
      "notes": "FitDesk 0.8.0 renforce fortement le pilotage commercial : pipeline plus riche, métriques fiables et segmentation claire entre coachs et athlètes. Le suivi prospect devient un outil stratégique soutenu par une API plus propre et un front revalorisé.",
      "projects": {
        "/api": [
          "Exclusion automatique des prospects supprimés des résultats.",
          "Suppression des slugs dans les mutations des programmes, plans nutritionnels et clients.",
          "Support complet de l'historique des étapes du pipeline, exposé pour le front.",
          "Consultation des exercices ouverte à tous les rôles pour simplifier les imports."
        ],
        "/backoffice": [
          "Dashboards coach et athlète désormais séparés et mieux structurés.",
          "Accès contrôlé aux sections sensibles pour éviter les erreurs de navigation.",
          "Module Prospects amélioré : filtres unifiés, cartes structurées et indicateurs consolidés."
        ],
        "/frontoffice": [
          "Nouveau résumé KPI en haut du pipeline (volumes, sources, progression).",
          "Historique des transitions et nombre de jours dans chaque étape visibles sur les cartes.",
          "Refonte des cartes prospects et filtres mis en avant pour une lisibilité accrue.",
          "Suppression des slugs côté création/édition et alignement des libellés."
        ],
        "/showcase": [
          "Alignement éditorial global pour suivre les évolutions commerciales à venir."
        ]
      }
    },
    {
      "version": "0.7.0",
      "title": "Gestion des Prospects & Pipeline CRM",
      "date": "2025-11-24",
      "global": [
        "Refonte complète du module Prospects, avec gestion par étapes et glisser-déposer.",
        "Uniformisation des statuts et terminologies entre API, backoffice et frontoffice.",
        "Optimisation de la navigation et des interfaces multilingues.",
        "Amélioration du design et de la lisibilité sur toutes les vues."
      ],
      "notes": "FitDesk 0.7.0 fait évoluer la plateforme vers une véritable solution CRM pour coachs. La relation entre le coach et ses prospects devient visuelle, fluide et pilotable depuis un seul espace. Cette version unifie le vocabulaire, simplifie les processus et prépare les prochaines étapes : la conversion des prospects en clients actifs au sein d’un parcours totalement intégré.",
      "projects": {
        "/api": [
          "Refonte de la logique interne des prospects, avec uniformisation des statuts et valeurs partagées.",
          "Mise à jour du schéma pour supporter les états de pipeline et la gestion des transitions.",
          "Documentation des cas d’usage pour une meilleure cohérence fonctionnelle.",
          "Nettoyage des anciens concepts de client en faveur du modèle prospect unifié."
        ],
        "/backoffice": [
          "Nouveau module Prospects avec pipeline visuel par étapes (drag & drop).",
          "Suivi des prospects selon leur statut commercial et dernière mise à jour.",
          "Refonte des fiches prospect avec plus d’informations synthétiques.",
          "Adaptation automatique à la langue du coach pour une gestion multilingue fluide."
        ],
        "/frontoffice": [
          "Remplacement du module “Clients” par un module Prospects repensé.",
          "Vue pipeline intégrée avec cartes, statuts et interactions par glisser-déposer.",
          "Filtrage automatique selon la langue de travail.",
          "Meilleure cohérence des termes et du design entre les sections (programmes, nutrition, gestion)."
        ],
        "/showcase": [
          "Pas de changements fonctionnels, mais harmonisation du contenu pour correspondre à la nouvelle terminologie (prospect au lieu de client) et préparation des futures évolutions orientées business."
        ]
      }
    },
    {
      "version": "0.6.0",
      "title": "Relation Coach-Athlète & Suivi Unifié",
      "date": "2025-11-20",
      "global": [
        "[NOUVEAUTÉ] Gestion complète des prospects, clients et athlètes avec suivi unifié.",
        "[RELATION] Introduction de la relation directe coach ↔ athlète pour structurer l'accompagnement.",
        "[VISIBILITÉ] Amélioration du contrôle de visibilité des programmes, repas et contenus clés.",
        "[EXPÉRIENCE] Interfaces harmonisées entre modules pour simplifier les flux quotidiens des coachs."
      ],
      "notes": "FitDesk 0.6.0 place la relation coach–athlète au centre : les équipes disposent d'outils pour qualifier prospects, gérer clients et suivre les athlètes tout en conservant une visibilité claire sur les contenus et les plans.",
      "projects": {
        "/api": [
          "Ajout du système de relations coach–athlète avec gestion souple et suppression douce.",
          "Introduction de la base d'objectifs et préférences clients couvrant nutrition, activité et ambitions sportives.",
          "Gestion complète des prospects avec statuts, niveaux, sources et préférences d'activité.",
          "Uniformisation des statuts de visibilité pour les programmes et plans de repas.",
          "Simplification des modèles et retrait des anciens niveaux de difficulté pour clarifier la couche métier."
        ],
        "/backoffice": [
          "Nouveau module de gestion des prospects et clients avec suivi du statut, des objectifs et des préférences.",
          "Section dédiée aux athlètes pour orchestrer les relations coach–athlète.",
          "Possibilité d'ajuster la visibilité des programmes et plans nutritionnels directement depuis l'interface.",
          "Présentation des données revue : fiches clients enrichies, sources, créateurs et détails accessibles instantanément."
        ],
        "/frontoffice": [
          "Module complet de gestion des clients avec création, édition, suppression et suivi contextualisé.",
          "Espace Athlètes connecté au backoffice pour gérer les relations et le suivi terrain.",
          "Interfaces retravaillées : formulaires clarifiés, blocs thématiques simplifiés et alignés sur la charte graphique.",
          "Nettoyage des données héritées et suppression de l'ancien concept de niveau d'exercice."
        ],
        "/showcase": [
          "Ajustements internes pour préserver la cohérence et la fluidité avec les nouveaux modules métiers."
        ]
      }
    },
    {
      "version": "0.5.0",
      "title": "Éditeur de Plans Nutritionnels",
      "date": "2025-11-06",
      "global": [
        "[NOUVEAUTÉ] Nouvel éditeur complet de plans nutritionnels pour coachs et athlètes.",
        "[EXPÉRIENCE] Gestion visuelle des icônes de types de repas et interface de suivi unifiée.",
        "[ERGONOMIE] Parcours de construction des plans plus clair, fluide et cohérent entre les modules.",
        "[ALIGNEMENT] Convergence renforcée entre programmes d'entraînement et nutrition personnalisée."
      ],
      "notes": "FitDesk 0.5.0 pose les bases d'une plateforme totalement unifiée entre entraînement et nutrition, avec une interface plus fluide, expressive et autonome pour les coachs comme pour les athlètes.",
      "projects": {
        "/api": [
          "Support complet des icônes de types de repas exposées dans les applications clientes.",
          "Schémas GraphQL enrichis pour structurer précisément plans, repas et métadonnées.",
          "Gestion d'erreurs durcie lors des mises à jour afin de garantir des retours fiables.",
          "Nettoyage des suites de tests et adoption d'ESLint pour homogénéiser le code."
        ],
        "/backoffice": [
          "Pilotage des icônes de repas directement depuis l'interface d'administration.",
          "Module nutrition repensé pour refléter les nouveaux types et données disponibles.",
          "Ajustements visuels apportant une navigation plus claire et homogène."
        ],
        "/frontoffice": [
          "Nouveau constructeur de plans nutritionnels aligné sur le builder de programmes.",
          "Création, édition et suppression complètes des repas et plans personnels.",
          "Affichage des icônes de repas et d'un résumé nutritionnel mis à jour en temps réel.",
          "Interfaces jour, repas et plan repensées avec édition in-app et design revu.",
          "Refonte du builder d'exercices et meilleure intégration avec les programmes existants.",
          "Simplification du chargement global avec disparition des écrans d'attente redondants."
        ],
        "/showcase": [
          "Maintien de la cohérence graphique et linguistique en préparation des futures extensions publiques."
        ]
      }
    },
    {
      "version": "0.4.0",
      "title": "Suite Nutrition Complète",
      "date": "2025-10-15",
      "global": [
        "[NOUVEAUTÉ] Suite Nutrition : ajout d'une gestion complète des repas, journées et plans nutritionnels.",
        "[AMÉLIORATION] Expérience unifiée : traductions améliorées, interface harmonisée, navigation plus fluide.",
        "[FIABILITÉ] Fiabilité accrue : large couverture de tests unitaires sur tous les domaines clés.",
        "[DESIGN] Design cohérent : interfaces épurées, hiérarchie visuelle renforcée et meilleure lisibilité."
      ],
      "notes": "FitDesk 0.4.0 marque une étape importante : l'intégration complète de la nutrition dans l'écosystème, une expérience utilisateur unifiée et une base technique renforcée.",
      "projects": {
        "/api": [
          "Ajout des entités repas, type de repas, journée de repas et plan nutritionnel avec un CRUD complet.",
          "Ajustements du schéma GraphQL (métadonnées, relations nullables, retours unifiés) pour soutenir la nutrition.",
          "Ajout massif de tests unitaires sur les cas d'usage utilisateur, session, programme, exercice, catégorie, repas, muscle et plan.",
          "Amélioration de la configuration Jest pour garantir des exécutions de tests fiables."
        ],
        "/backoffice": [
          "Nouveau module Gestion nutritionnelle avec onglets types de repas, journées et plans.",
          "Possibilité de modifier la visibilité des types de repas pour contrôler l'exposition côté athlète.",
          "Ajustement de la largeur et de la structure de la barre de navigation pour accueillir la nutrition.",
          "Expérience plus fluide pour créer, modifier et suivre les données nutritionnelles."
        ],
        "/frontoffice": [
          "Ajout d'un outil de clonage de programme pour gagner du temps lors de la duplication.",
          "Fenêtre de confirmation de suppression avant la suppression d'un programme.",
          "Divers ajustements visuels et ergonomiques pour une cohérence accrue côté athlète."
        ],
        "/showcase": [
          "Détection automatique de la langue du navigateur dès l'arrivée sur la vitrine.",
          "Traduction et mise en page de la page des notes de version simplifiées."
        ]
      }
    },
    {
      "version": "0.3.0",
      "title": "Navigation par Rôles & Profils",
      "date": "2025-10-27",
      "global": [
        "[NOUVEAUTÉ] Navigation et accès désormais adaptés à chaque rôle sur l'ensemble des applications.",
        "[NOUVEAUTÉ] Programmes athlètes enrichis avec listes, fiches détaillées et indicateurs issus des instantanés.",
        "[NOUVEAUTÉ] Profils athlètes et coachs harmonisés entre les interfaces front et back office.",
        "[NOUVEAUTÉ] Page de connexion réinventée avec un sélecteur de langue accessible dès l'accueil.",
        "[CORRECTION] Règles de visibilité consolidées pour les programmes athlètes et les ressources d'entraînement publiques.",
        "[CORRECTION] Métadonnées des arguments GraphQL et résolutions de listes ajustées pour garantir des retours cohérents."
      ],
      "notes": "",
      "projects": {
        "/api": [
          "Montée de version mineure en préparation du prochain jalon API.",
          "Ajout de garde-fous de limitation de débit sur les points d'accès publics afin de prévenir les abus.",
          "Extension de l'export analytique du repêchage pour intégrer des métriques avancées.",
          "Renforcement de l'authentification avec rotation des jetons de rafraîchissement.",
          "Centralisation des flux de journalisation d'audit pour une observabilité uniforme.",
          "Mise à niveau des dépendances pour rester aligné avec la base de services partagée."
        ],
        "/backoffice": [
          "Montée de version mineure en vue du prochain déploiement backoffice.",
          "Ajout de l'export du journal d'audit directement depuis le panneau d'administration.",
          "Actualisation horaire des caches analytiques du tableau de bord pour limiter les données obsolètes.",
          "Durcissement du parcours de réinitialisation de mot de passe grâce à un contrôle de la fréquence des jetons.",
          "Mise à jour de la matrice de dépendances pour s'aligner sur les services API en v0.6.0."
        ],
        "/frontoffice": [
          "Montée de version mineure en préparation du prochain cycle frontoffice.",
          "Réorganisation de la navigation globale avec des points d'entrée clarifiés pour l'accueil, les programmes et les outils utilisateurs.",
          "Ajout de fils d'Ariane contextuels pour fluidifier la circulation entre vues d'ensemble et fiches programme.",
          "Catalogue de programmes enrichi avec des parcours mis en avant et des filtres avancés pour les participants.",
          "Parcours d'inscription aux programmes retravaillé avec validations instantanées et messages d'éligibilité explicites.",
          "Tableau de bord de profil repensé pour mettre en avant la progression et les jalons à venir.",
          "Gestion de session renforcée pour réduire les expirations intempestives et fiabiliser le mode souvenir.",
          "Synchronisation des traductions françaises et anglaises pour les parcours de navigation, programmes et profils."
        ]
      }
    }
  ]
}