{
  "releases": [
    {
      "date": "2025-10-27",
      "global": [
        "[NOUVEAUTÉ] Navigation et accès ajustés pour chaque rôle sur l'ensemble des applications.",
        "[NOUVEAUTÉ] Programmes athlètes enrichis de listes, fiches détaillées et indicateurs d'instantanés.",
        "[NOUVEAUTÉ] Profils athlètes et coachs harmonisés entre front et back office.",
        "[NOUVEAUTÉ] Page de connexion repensée avec un sélecteur de langue dès l'accueil.",
        "[CORRECTION] Règles de visibilité consolidées pour les programmes athlètes et les ressources publiques.",
        "[CORRECTION] Métadonnées GraphQL et résolutions de listes ajustées pour des réponses cohérentes."
      ],
      "notes": "",
      "projects": {
        "/api": [
          "Version mineure relevée en vue du prochain jalon.",
          "Limitation de débit renforcée sur les points d'accès publics.",
          "Export analytique du repêchage enrichi de métriques avancées.",
          "Rotation des jetons de rafraîchissement pour sécuriser l'authentification.",
          "Flux de journalisation d'audit centralisés pour une lecture unifiée.",
          "Dépendances mises à niveau et alignées sur la base de services commune."
        ],
        "/backoffice": [
          "Version mineure alignée sur le prochain déploiement.",
          "Export du journal d'audit disponible depuis le panneau d'administration.",
          "Caches analytiques du tableau de bord régénérés chaque heure.",
          "Réinitialisation de mot de passe sécurisée par un contrôle de fréquence.",
          "Matrice de dépendances synchronisée avec l'API en v0.6.0."
        ],
        "/frontoffice": [
          "Version mineure prête pour le prochain cycle.",
          "Navigation globale clarifiée entre accueil, programmes et outils.",
          "Fils d'Ariane contextuels pour relier vues d'ensemble et fiches.",
          "Catalogue de programmes valorisé par des parcours phares et des filtres avancés.",
          "Parcours d'inscription fluidifié avec validations instantanées et messages d'éligibilité.",
          "Tableau de bord de profil recentré sur la progression et les jalons à venir.",
          "Gestion de session renforcée pour limiter les expirations inattendues et fiabiliser le mode souvenir.",
          "Traductions françaises et anglaises harmonisées sur la navigation, les programmes et les profils."
        ]
      },
      "title": "Release 0.3.0",
      "version": "0.3.0"
    }
  ]
}
